<?php





// 定義包含英文小寫字母和數字的陣列
// $characters = array_merge(range('a', 'z'), range(0, 9));

// 初始化亂數密碼字串
// $password = '';

// 使用迴圈控制10碼顯示長度
// for ($i = 0; $i < 10; $i++) {
    // 隨機獲取陣列索引
    // $randomIndex = array_rand($characters);
    
    // 將隨機獲取的字元加入到亂數密碼字串中
    // $password .= $characters[$randomIndex];
// }

// 顯示最終的10碼亂數密碼
// $password = "密碼:" . $password;     
// echo $password, '';

///////////////////////////////////////////////////////////////////////////////
//課堂練習





///////////////////////////////////////////////////////
//一個空陣列 $arr
//$arr = [];
//一個 for 迴圈，從 1 開始遞增到 50,$i 是迴圈的計數器。
//for($i=1; $i<=50; $i++){
//使用 if 查$i 是否為 5 的倍數
//if($i % 5 == 0){
//$i 是 5 的倍數，它加入到 $arr 
//$GetCurrentarray_push($arr, $i);
// }
// }
// shuffle($arr);
// print_r($arr);



/////////////////////////////////////////

// 建立一個空陣列來存放最大值為 50 的 5 的倍數
// $numbers = array();

// 使用迴圈尋找 5 的倍數，並將其加入陣列中
// for ($i = 5; $i <= 50; $i += 5) {
//     $numbers[] = $i;
// }

// 將陣列進行重新排序
// sort($numbers);

// 使用 print_r() 顯示結果
// print_r($numbers);

///////////////////////////////////////////////
//Foreach迴圈
//$arr = [80, 93, 45];
//foreach($arr as $key => $value){
//cho $value;
//echo "<br/>";
//}

////////////////////////////////////////////////////
//For迴圈
//$arr = [80, 93, 45]; //宣告了一個陣列 $arr
//for ($i = 0; $i < 3; $i++){ // for 迴圈 $i重0開始 是否小於 3
    //echo $arr[$i];
   //echo"<br/>";
//}


///////////////////////////////////////////////////////
//for....for 巢狀迴圈

// for($i = 1; $i <=9; $i++){
//     for($j = 1; $j <= 9; $j++){
//     echo $i."*".$j."=".$i * $j;
//     echo "<br/>";
//      }
//      echo "<br/>";
// }   

///////////////////////////////////////////////////////
// for 句型
//  ##利用for loop計算1+2+3+….+50總和?##

//$sum = 0;  //$sum的變數,初始化為0

//for ($i = 1; $i <= 50; $i++) {
    //for迴圈，設$i=1，迴圈條件為$i <= 50（即$i小於等於50），並且每次迴圈結束後，將$i遞增1。
    //$sum += $i;  //$sum = $sum + $i;
    //$sum的值都會增加$i的值。
//}

//echo "總和： " . $sum;
//consol.log的意思 印出來


///////////////////////////////////////////////////////
// ##印出 1~50之間 3的倍數，並計算這些數的總和##

// $sum = 0;//$sum的變數,初始化為0

// for ($i = 1; $i <= 50; $i++) {
//     if ($i % 3 === 0) {
//         echo $i . ' ';
//         $sum += $i;
//     }
// }

// echo "\n總和： " . $sum;



///////////////////////////////////////////////////////
//switch句型
// $type = "1";
// switch($type){
//     case"1":
//         $amt = 6000;
//         break;
//     case"2":
//         $amt = 5000;
//         break;
//     case"3":
//         $amt = 4000;
//         break;
//         default:
//         $amt = 0;
// }
// echo "補助款為 ".$amt." 元";



///////////////////////////////////////////////////////
//if...else句型
// $score = 88;
// if($score >= 90){
//     $grade = "A";
// }else if ($score >= 80){
//     $grade = "B";
// }else if ($score >= 70){
//     $grade = "C";
// }else if ($score >= 60){
//     $grade = "D";
// }else{
//     $grade = "E";
// }
//     echo "等級為".$grade

///////////////////////////////////////////////////////
//IF句型   
// $score =  40;

// echo $score >= 60 ? "PASS" : "FAIL";

// if($score >= 60){
//     echo "PASS";
// }else{
//     echo "Fail";
// }
?>


